cf/InformationRegisters/Prices.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Prices</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>PriceType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PriceTypes</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Product</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Products</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/CommonModules/PriceManagementServerCall/Ext/Module.bsl
#Region Public

// Gets price by price type and product
//
// Parameters:
//  DataStructure - Structure - parameters of getting
//
// Returns:
//  Number - price
//
Function GetProductPriceByPriceType(DataStructure) Export
	
	Price = 0;
	
	If Not (ValueIsFilled(DataStructure.Product) And ValueIsFilled(DataStructure.PriceType)) Then
		Return Price;
	EndIf;
	
	Query = New Query;
	Query.Text =
	"SELECT ALLOWED
	|	PricesSliceLast.Price * &DocumentRepetition / &DocumentRate AS Price
	|FROM
	|	InformationRegister.Prices.SliceLast(
	|			&PriceDate,
	|			PriceType = &PriceType
	|				AND Product = &Product) AS PricesSliceLast";
	
	Query.SetParameter("PriceDate",				BegOfDay(DataStructure.Date));
	Query.SetParameter("Product",				DataStructure.Product);
	Query.SetParameter("PriceType",				DataStructure.PriceType);
	Query.SetParameter("DocumentRate",			?(DataStructure.ExchangeRate = 0, 1, DataStructure.ExchangeRate));
	Query.SetParameter("DocumentRepetition",	?(DataStructure.Multiplier = 0, 1, DataStructure.Multiplier));
	
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		Price = Selection.Price;
	EndIf;
	
	Return Price;
	
EndFunction

// Gets price by price type and product array
//
// Parameters:
//  DataStructure - Structure - parameters of getting
//
// Returns:
//  Map - key and value collection (Product and Price)
//
Function GetTabularSectionPricesByPriceType(DataStructure) Export
	
	ProductPriceMap = New Map;
	
	If Not ValueIsFilled(DataStructure.PriceType) Then
		Return ProductPriceMap;
	EndIf;
	
	Query = New Query;
	Query.Text =
	"SELECT ALLOWED
	|	PricesSliceLast.Product AS Product,
	|	PricesSliceLast.Price * &DocumentRepetition / &DocumentRate AS Price
	|FROM
	|	InformationRegister.Prices.SliceLast(
	|			&PriceDate,
	|			PriceType = &PriceType
	|				AND Product IN (&ProductArray)) AS PricesSliceLast";
	
	Query.SetParameter("PriceDate",				BegOfDay(DataStructure.Date));
	Query.SetParameter("PriceType",				DataStructure.PriceType);
	Query.SetParameter("DocumentRate",			?(DataStructure.ExchangeRate = 0, 1, DataStructure.ExchangeRate));
	Query.SetParameter("DocumentRepetition",	?(DataStructure.Multiplier = 0, 1, DataStructure.Multiplier));
	Query.SetParameter("ProductArray",			DataStructure.ProductArray);
	
	PriceTable = Query.Execute().Unload();
	PriceTable.Indexes.Add("Product");
	
	For Each Product In DataStructure.ProductArray Do
		
		If ProductPriceMap.Get(Product) = Undefined Then
			
			PriceRow = PriceTable.Find(Product, "Product");
			If PriceRow = Undefined Then
				Price = 0;
			Else
				Price = PriceRow.Price;
			EndIf;
			
			ProductPriceMap.Insert(Product, Price);
			
		EndIf;
		
	EndDo;
	
	Return ProductPriceMap;
	
EndFunction

#EndRegion
